from flask import Flask
from flask_sqlalchemy import SQLAlchemy
from flask_bcrypt import Bcrypt 
from flask_login import LoginManager
from flask_mail import Mail
import os

app = Flask(__name__)
app.config['SECRET_KEY'] = "my super secret key that no one is supposed to know"
#app.config['SQLALCHEMY_DATABASE_URI'] = 'postgres://username:password@hostname:port/users.db'
app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///database/RunnersPlus.db'
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
#-----------------------------------------
os.environ["OAUTHLIB_INSECURE_TRANSPORT"] = "0" # να είναι Οκ και σελίδες http
GOOGLE_CLIENT_ID = "297111664567-54f1g0v2716l15r213pj3uaq9ksn87qs.apps.googleusercontent.com"
#-----------------------------------

db = SQLAlchemy(app)
app.app_context().push()
bcrypt = Bcrypt(app)
login_manager = LoginManager(app)
#---------------------------------------------------
app.config['MAIL_SERVER'] = 'smtp.googlemail.com'
app.config['MAIL_PORT'] = 587
app.config['MAIL_USE_TLS'] = True
# app.cofing['MAIL_USE_SSL'] = 
app.config['MAIL_USERNAME'] = 'argyroi'
app.config['MAIL_PASSWORD'] = 'lokw dzrr bgmr qrnv'

#--------------------------------------------
app.config["RECAPTCHA_PUBLIC_KEY"] = "6LfhDdgpAAAAAKgOWgtuFLLLhTRiAYcDVk2EcY2M"
app.config["RECAPTCHA_PRIVATE_KEY"] = "6LfhDdgpAAAAAOOaBjKk3aHprsQvly2MNJwLBwJv"
#------------------------------------------
CITIES_DATA = {
    "Ανατολικής Μακεδονίας & Θράκης":[
        "Αβδήρων", "Αλεξανδρούπολης", "Αρριάνων", "Διδυμοτείχου",
        "Δοξάτου", "Δράμας", "Θάσου", "Ιάσμου","Καβάλας", 
        "Κάτω Νευροκοπίου", "Κομοτηνής", "Μαρωνείας - Σαπών", "Μυκής", 
        "Νέστου", "Ξάνθης", "Ορεστιάδας", "Παγγαίου", "Παρανεστίου", 
        "Προσοτσάνης", "Σαμοθράκης", "Σουφλίου", "Τοπείρου"
    ],
    "Αττικής": [
        "Αγίας Βαρβάρας", "Αγίας Παρασκευής", "Αγίου Δημητρίου", 
        "Αγίων Αναργύρων - Καματερού","Αγκιστρίου", "Αθηναίων", "Αιγάλεω", 
        "Αίγινας","Αλίμου", "Αμαρουσίου", "Ασπροπύργου", "Αχαρνών",
        "Βαρής - Βούλας - Βουλιαγμένης", "Βριλησσίων", "Βυρωνός", "Γαλατσίου",
        "Γλυφάδας", "Δαφνής - Υμηττού", "Διονύσου", "Ελευσίνας",
        "Ελληνικού - Αργυρούπολης", "Ζωγράφου", "Ηλιούπολεως", "Ηρακλείου",
        "Ιλίου", "Καισαριανής", "Καλλιθέας", "Κερατσινίου - Δραπετσώνας",
        "Κηφισιάς", "Κορυδαλλού", "Κρωπίας", "Κυθήρων",
        "Λαυρεωτικής", "Λυκοβρύσης - Πεύκης", "Μάνδρας - Ειδυλλίας", "Μαραθώνος",
        "Μαρκοπούλου Μεσογαίας", "Μεγαρέων", "Μεταμορφώσεως", "Μοσχάτου - Ταύρου",
        "Νέας Ιωνίας", "Νέας Σμύρνης", "Νέας Φιλαδέλφειας - Νέας Χαλκηδόνος", 
        "Νικαίας - Αγίου Ιωάννη Ρέντη", "Παιανίας", "Παλαιού Φαλήρου", "Παλλήνης", 
        "Παπάγου - Χολαργού", "Πειραιώς", "Πεντέλης", "Περάματος", "Περιστερίου",
        "Πετρούπολεως", "Πόρου", "Ραφήνας - Πικερμίου", "Σαλαμίνος",
        "Σαρωνικού", "Σπάτων - Αρτέμιδος", "Σπέτσων", "Τροιζηνίας - Μεθάνων",
        "Υδρας", "Φιλοθέης - Ψυχικού", "Φυλής", "Χαϊδαρίου",
        "Χαλανδρίου", "Ωρωπού"
    ],
    "Βορείου Αιγαίου": [
        "Αγίου Ευστρατίου", "Ανατολικής Σάμου", "Δυτικής Λέσβου", 
        "Δυτικής Σάμου", "Ικαρίας", "Λήμνου", "Μυτιλήνης", 
        "Οινουσσών", "Φούρνων Κορσέων", "Χίου", "Ψαρών"
    ],
    "Δυτικής Ελλάδας":[
        "Αγρινίου", "Αιγιαλείας", "Ακτίου - Βόνιτσας", "Αμφίλοχίας",
        "Ανδραβίδας - Κυλλήνης", "Ανδρίτσαινας - Κρεστένων", "Αρχαίας Ολυμπίας", 
        "Δυτικής Αχαΐας",  "Ερυμάνθου", "Ζαχάρως", "Ηλίδας", "Θέρμου",
        "Ιεράς Πόλης Μεσολογγίου", "Καλαβρύτων", "Ναυπακτίας", "Ξηρομέρου",
        "Πατρέων", "Πηνείου", "Πύργου"
    ],
    "Δυτικής Μακεδονίας":[
        "Αμυνταίου", "Άργους Ορεστικού", "Βελβεντού", "Βοΐου",
        "Γρεβενών", "Δεσκάτης", "Εορδαίας", "Καστοριάς",
        "Κοζάνης", "Νεστορίου", "Πρεσπών", "Σερβίων", "Φλώρινας"
    ],
    "Ηπείρου":[
        "Αρταίων", "Βορείων Τζουμέρκων", "Γεωργίου Καραϊσκάκη", "Δωδώνης",
        "Ζαγορίου", "Ζήρου", "Ζίτσας", "Ηγουμενίτσας",
        "Ιωαννιτών", "Κεντρικών Τζουμέρκων", "Κονίτσας", "Μετσόβου",
        "Νικολάου Σκούφα", "Πάργας", "Πρέβεζας", "Πωγωνίου",
        "Σουλίου", "Φιλιάτων"
    ],
    "Θεσσαλίας":[
        "Αγιάς", "Αλμύρου", "Αλοννήσου", "Αργιθέας",
        "Βόλου", "Ελασσόνας", "Ζαγοράς - Μουρεσίου", "Καρδίτσας",
        "Κιλελέρ", "Λαρισαίων", "Λίμνης Πλαστήρα", "Μετεώρων",
        "Μουζακίου", "Νοτίου Πηλίου", "Παλαμά", "Πυλής",
        "Ρήγα Φεραίου", "Σκιάθου", "Σκοπέλου", "Σοφάδων",
        "Τεμπών", "Τρικκαίων", "Τυρνάβου", "Φαρκαδόνας",
        "Φαρσάλων"
    ],
    "Ιονίων Νήσων":[
        "Αργοστολίου", "Βόρειας Κέρκυρας", "Ζακύνθου", "Ιθάκης",
        "Λευκάδας", "Ληξουρίου", "Μεγανησίου", "Νότιας Κέρκυρας",
        "Παξών", "Σάμης"
    ],
    "Κεντρικής Μακεδονίας":[
        "Αγίου Όρους", "Αλεξανδρείας", "Αλμωπίας", "Αμπελοκήπων - Μενεμένης",
        "Αμφίπολης", "Αριστοτέλη", "Βέροιας", "Βισαλτίας",
        "Βόλβης", "Δέλτα", "Δίου - Ολύμπου", "Έδεσσας",
        "Εμμανουήλ Παππά", "Ηράκλειας", "Νάουσας",
        "Θερμαϊκού", "Θέρμης", "Θεσσαλονίκης", "Καλαμαριάς",
        "Κασσάνδρας", "Κατερίνης", "Κιλκίς", "Κορδελίου - Ευόσμου",
        "Λαγκαδά", "Νεάπολης - Συκεών", "Νέας Ζίχνης", "Νέας Προποντίδας",
        "Παιονίας", "Παύλου Μέλα", "Πέλλας", "Πολυγύρου",
        "Πύδνας - Κολινδρού", "Πυλαίας - Χορτιάτη", "Σερρών", "Σιθωνίας",
        "Σιντικής", "Σκύδρας", "Χαλκηδόνος", "Ωραιοκάστρου"
    ],
    "Κρήτης": [
        "Αγίου Βασιλείου", "Αγίου Νικόλαου", "Αμαρίου", "Ανωγείων",
        "Αποκορώνου", "Αρχάνων - Αστερουσίων", "Βιάννου", "Γαύδου",
        "Γορτυνάς", "Ηρακλείου", "Ιεράπετρας", "Καντάνου - Σελίνου",
        "Κισσάμου", "Μαλεβιζίου", "Μινώα Πεδιάδας", "Μυλοποτάμου",
        "Οροπεδίου Λασιθίου", "Πλατανιά", "Ρεθύμνης", "Σητείας", "Σφακίων",
        "Φαιστού", "Χανίων", "Χερσονήσου"
        ],
    "Νοτίου Αιγαίου": [
        "Αγαθονησίου", "Αμοργού", "Ανάφης", "Άνδρου", "Αντιπάρου",
        "Αστυπάλαιας", "Θήρας", "Ιητών", "Καλυμνίων", "Καρπάθου", "Κάσου",
        "Κέας", "Κιμώλου", "Κύθνου", "Κω", "Λειψών", "Λέρου", "Μεγίστης",
        "Μήλου", "Μυκόνου", "Νάξου και Μικρών Κυκλάδων", "Νισύρου",
        "Πάρου", "Πάτμου", "Ρόδου", "Σερίφου", "Σικίνου", "Σίφνου",
        "Σύμης", "Σύρου - Ερμούπολης", "Τήλου", "Τήνου", "Φολεγάνδρου",
        "Χαλκής"
        ],
    "Πελοποννήσου":[
        "Ανατολικής Μάνης", "Αργούς - Μυκηνών", "Βέλου - Βοχάς", "Βορείας Κυνουρίας",
        "Γορτυνίας", "Δυτικής Μάνης", "Ελαφονήσου", "Επιδαύρου",
        "Ερμιονίδας", "Ευρώτα", "Καλαμάτας", "Κορινθίων",
        "Λουτρακίου - Περαχώρας - Αγίων Θεοδώρων", "Μεγαλόπολης", "Μεσσηνίας", 
        "Μονεμβασίας", "Ναυπλιέων", "Νεμέας", "Νοτίας Κυνουρίας", 
        "Ξυλοκάστρου - Ευρωστίνης", "Οιχαλίας", "Πύλου - Νέστορος", "Σικυωνίων", 
        "Σπάρτης", "Τρίπολης", "Τριφυλίας"
        ],
    "Στερεάς Ελλάδας":[
        "Αγράφων", "Αλιάρτου - Θεσπιέων", "Αμφίκλειας - Ελατείας", "Δελφών",
        "Διρφύων - Μεσσαπίων", "Διστόμου - Αράχοβας - Αντικύρας", "Δομοκού", "Δωρίδος",
        "Ερετρίας", "Θηβαίων", "Ιστιαίας - Αιδηψού", "Καμένων Βούρλων", "Καρπενησίου",
        "Καρυστίου", "Κύμης - Αλιβερίου", "Λαμιέων", "Λεβαδείων", "Λοκρών",
        "Μακρακώμης", "Μαντουδίου - Λίμνης - Αγίας Αννας", "Ορχομενού", "Σκύρου",
        "Στυλίδος", "Τανάγρας", "Χαλκιδέων"
        ]
       
    }

mail  =Mail(app)

from RacePlus import routes 